TLDR: Terraform user error, basically. I'll go ahead and close this, but wanted to capture context in case it's useful to you or anyone else here.

I think I made the mistake of running `terraform apply` from `./backend` in a fresh clone of my repo to simulate what would happen with an additional developer. When I read the terraform plan output more closely it helped me realize what was going on. In this scenario the plan says it would create a new `aws_s3_bucket.nixos-in-production` resource, for instance, but I didn't want new S3 state.

I tried it again, this time rejecting that plan and instead running `terraform init` and `terraform apply` from `./` (rather than `./backend`) in the fresh clone. That plan looks closer to what I expected:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # local_sensitive_file.ssh_private_key will be created
  + resource "local_sensitive_file" "ssh_private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "./id_ed25519"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

After executing the plan, the `id_ed25519` that's restored from the Terraform S3 state matches the private key file from my original clone.

Once I got everything cleaned up, all the secrets rotated, and everything redeployed properly the `autoUpgrade` service worked beautifully. Getting back to that was somewhat painful, though, because I accidentally typed `extra-access-token` instead of `extra-access-tokens` when recreating `secrets.yaml` with the help of `sop`. Because I was merely rotating secrets and not reverting back to when `autoUpgrade` wasn't enabled, the deployed server couldn't use the fine-grained access token to read my private GitHub repo. Sadly, patching up `secrets.yaml` using `sop`, updating my `main` branch, and then running `terraform apply` wasn't sufficient to fix it. There's probably a quick fix, but it wasn't immediately obvious so I opted to purge AWS/Terraform/sop state and carefully repeat the deployment.